{
  "1": [
    "Рецепт пирога",
    "https://www.russianfood.com/recipes/recipe.php?rid=119139",
    1787429991.0
  ],
  "2": [
    "Список продуктов",
    "1 - хлеб, 10 - яйца, 1 кг - яблоки, 3 кг - фисташки",
    777.0
  ],
  "3": [
    "Неопределенность Гейзенберга",
    "Соотношение неопределенностей, устанавливающее предел точности одновременного определения пары характеризующих систему квантовых наблюдаемых, описываемых некоммутирующими операторами",
    7777.0
  ],
  "5": [
    "qqqqq",
    "wwwwwww",
    77777.0
  ],
  "6": [
    "Случайно сгенерированный текст (1071 символ)",
    "С учётом сложившейся международной обстановки, выбранный нами инновационный путь однозначно фиксирует необходимость инновационных методов управления процессами. С другой стороны, убеждённость некоторых оппонентов представляет собой интересный эксперимент проверки новых предложений. Не следует, однако, забывать, что высокотехнологичная концепция общественного уклада предполагает независимые способы реализации соответствующих условий активизации! Повседневная практика показывает, что синтетическое тестирование позволяет выполнить важные задания по разработке инновационных методов управления процессами. Принимая во внимание показатели успешности, разбавленное изрядной долей эмпатии, рациональное мышление, в своём классическом представлении, допускает внедрение новых предложений. Есть над чем задуматься: реплицированные с зарубежных источников, современные исследования набирают популярность среди определенных слоев населения, а значит, должны быть ограничены исключительно образом мышления. Однозначно, представители современных социальных резервов разоблачены.",
    777777.0
  ],
  "7": [
    "Заметочка",
    "Купи хлеба!",
    1987429991.0
  ],
  "8": [
    "wqeqwe",
    "qweqweqwe",
    1687429905.0
  ],
  "9": [
    "123",
    "321",
    1887429991.0
  ],
  "10": [
    "qwer",
    "rewq",
    1687429991.0
  ],
  "11": [
    "GeekBrain",
    "Java - Forever!",
    1687430677.0
  ],
  "12": [
    "Купить Книги!",
    "Букварь и зеленую книгу",
    1687431086.0
  ]
}